org/roam/file_systems.org
:PROPERTIES:
:ID:       7eb34c6f-cb5e-4e5d-a0c4-0139fb12d66a
:END:
#+title: file-systems
#+OPTIONS: toc:nil num:nil date:nil \n:nil html-style:nil author:nil timestamp:nil title:nil html-postamble:nil html5-fancy:t
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org-default.css" />
#+HTML_CONTENT_CLASS: container
#+HTML_DOCTYPE: html5
#+INCLUDE: "css.org::navbar" :only-contents t
* File Systems
Systems need filing!
** notes
- mkfs wipes an existing filesystem
  - uuid changes
** [[id:382f92d4-f76f-47b1-b4dd-33a39c11aaa2][zfs]]
** swap
- uses hard drive as memory page cache
- ~swapoff /swapfile~ to disable
- ~fallocate -l 2G /swapfile && mkswap /swapfile~ to create
- ~swapon /swapfile~ to enable
  - load zram module and setup swap partition for compression
** ntfs
- journal file system
- ~ntfsfix -d /dev/sdd1~ to fix dirty bit on unclear shutdown
- mount ntfs
  - ~sudo mkdir -p /run/media/$USER/Elements/~
  - ~sudo mount.ntfs /dev/sdd1 /run/media/jam/Elements -o rw,nodev,nosuid,uid=1000,gid=1000,windows_names,uhelper=udisks2~
** lustre
- HPC filesystem
- can use zfs as object store
- pure no io metadata server
- zero copy rdma with nvidia gpu direct storage
