file_systems.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>file-systems</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container">
<nav aria-label="breadcrumb" style="--pico-nav-breadcrumb-divider: '|';" id="org9db6a04">
<ul class="org-ul">
<li><a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a></li>
<li><a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a></li>
</ul>
</nav>
<div id="outline-container-org92859fb" class="outline-2">
<h2 id="org92859fb">File Systems</h2>
<div class="outline-text-2" id="text-org92859fb">
<p>
Systems need filing!
</p>
</div>
<div id="outline-container-orgb6e8963" class="outline-3">
<h3 id="orgb6e8963">notes</h3>
<div class="outline-text-3" id="text-orgb6e8963">
<ul class="org-ul">
<li>mkfs wipes an existing filesystem
<ul class="org-ul">
<li>uuid changes</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orga5c7429" class="outline-3">
<h3 id="orga5c7429"><a href="zfs.html#ID-382f92d4-f76f-47b1-b4dd-33a39c11aaa2">zfs</a></h3>
</div>
<div id="outline-container-orga6d801a" class="outline-3">
<h3 id="orga6d801a">swap</h3>
<div class="outline-text-3" id="text-orga6d801a">
<ul class="org-ul">
<li>uses hard drive as memory page cache</li>
<li><code>swapoff /swapfile</code> to disable</li>
<li><code>fallocate -l 2G /swapfile &amp;&amp; mkswap /swapfile</code> to create</li>
<li><code>swapon /swapfile</code> to enable
<ul class="org-ul">
<li>load zram module and setup swap partition for compression</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgd548dfc" class="outline-3">
<h3 id="orgd548dfc">ntfs</h3>
<div class="outline-text-3" id="text-orgd548dfc">
<ul class="org-ul">
<li>journal file system</li>
<li><code>ntfsfix -d /dev/sdd1</code> to fix dirty bit on unclear shutdown</li>
<li>mount ntfs
<ul class="org-ul">
<li><code>sudo mkdir -p /run/media/$USER/Elements/</code></li>
<li><code>sudo mount.ntfs /dev/sdd1 /run/media/jam/Elements -o rw,nodev,nosuid,uid=1000,gid=1000,windows_names,uhelper=udisks2</code></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org34fa334" class="outline-3">
<h3 id="org34fa334">lustre</h3>
<div class="outline-text-3" id="text-org34fa334">
<ul class="org-ul">
<li>HPC filesystem</li>
<li>can use zfs as object store</li>
<li>pure no io metadata server</li>
<li>zero copy rdma with nvidia gpu direct storage</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
